import { QuestionType } from '../types';

export const questions: QuestionType[] = [
  {
    text: '當你和朋友一起用餐時，在選擇用餐或是吃什麼時，你常是：',
    options: [
      { value: 1, text: '決定者：意見不同時，通常都是決定者' },
      { value: 2, text: '氣氛製造者：吃什麼，很能帶動情緒氣氛' },
      { value: 3, text: '附和者：隨便，沒意見' },
      { value: 4, text: '意見提供者：常去否定別人的提議，自己卻又沒意見，也不做任何決定' }
    ]
  },
  {
    text: '當你買衣服時，你是：',
    options: [
      { value: 1, text: '不易受售貨員影響，"心中自有定見"' },
      { value: 2, text: '售貨員的親切及好的感受，常會促進你的購買' },
      { value: 3, text: '找熟悉的店購買' },
      { value: 4, text: '品質與價錢是否成比例，價錢是否合理？' }
    ]
  },
  {
    text: '你的消費習慣是：',
    options: [
      { value: 1, text: '找到要買的東西，付錢走人' },
      { value: 2, text: '很隨意的逛，不特定買什麼' },
      { value: 3, text: '有一定的消費習慣，不太喜歡變化' },
      { value: 4, text: '較注意東西好不好，較有成本觀念' }
    ]
  },
  {
    text: '你的朋友，以一句話來形容你，他們會說：',
    options: [
      { value: 1, text: '蠻"鴨霸"的' },
      { value: 2, text: '熱情洋溢' },
      { value: 3, text: '溫和斯文' },
      { value: 4, text: '要求完美' }
    ]
  },
  {
    text: '你自認那一種形容，最能表現你的特色：',
    options: [
      { value: 1, text: '果敢的，能接受挑戰' },
      { value: 2, text: '生動活潑，不拘小節' },
      { value: 3, text: '愛傾聽，喜歡穩定' },
      { value: 4, text: '處世謹慎小心，重數據分析' }
    ]
  },
  {
    text: '你覺得做事的重點，應該是：',
    options: [
      { value: 1, text: '做什麼？重結果' },
      { value: 2, text: '誰來做？重感受（過程）' },
      { value: 3, text: '為何做？重品質' },
      { value: 4, text: '怎麼做？重執行' }
    ]
  },
  {
    text: '與同事有意見衝突（或不同）時，你是：',
    options: [
      { value: 1, text: '說服對方，聽從自己的意見' },
      { value: 2, text: '問其他同事或上司之意見，尋求支持' },
      { value: 3, text: '退讓，以和為貴' },
      { value: 4, text: '與衝突者協調，找尋最好的意見' }
    ]
  },
  {
    text: '什麼樣的工作環境，最能鼓舞你：',
    options: [
      { value: 1, text: '能讓你決定事情，具領導地位的' },
      { value: 2, text: '同事相處愉快，處處受歡迎' },
      { value: 3, text: '穩定中求發展' },
      { value: 4, text: '講品質，重效率的工作' }
    ]
  },
  {
    text: '以下的溝通方式，那一項最符合你：',
    options: [
      { value: 1, text: '直接了當，較權威式的' },
      { value: 2, text: '表情豐富，肢體語言較多' },
      { value: 3, text: '先聽聽別人意見，而後溫和的表達自己的意見' },
      { value: 4, text: '不露感情的，理多於情，愛分析，較冷靜' }
    ]
  },
  {
    text: '在每一次會議中或公司決讓提案時，你所扮演的角色為何：',
    options: [
      { value: 1, text: '據理力爭者' },
      { value: 2, text: '協調者' },
      { value: 3, text: '贊同多數者' },
      { value: 4, text: '分析所有提案以供參考者' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我做事一向以具體，短期能達到目標；決定快速，立即得到結果' },
      { value: 2, text: '在本性上，我喜歡跟人交往，各式各樣的人都行甚至陌生人也行' },
      { value: 3, text: '我不喜歡強出頭，寧可當後補' },
      { value: 4, text: '我是一個自我約束，很守紀律的人，凡事依既定目標行事' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我喜歡有變化，激烈且競爭的環境，是個可接受挑戰的人' },
      { value: 2, text: '我喜歡社交，也喜歡招待人' },
      { value: 3, text: '我喜歡成為小組的一份子，固守一般性程序' },
      { value: 4, text: '我會花很多時間去研究事與人' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我喜歡按自己的方法做事，不在乎別人對我的觀感，只要成功' },
      { value: 2, text: '有人跟我意見不一致時，我會很難過（困擾）' },
      { value: 3, text: '我知道做些改變是有必要的，但即使如此我還是覺得少冒險來的好' },
      { value: 4, text: '我對自己及他人的期望很高，這些都是為符合我的高標準' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我擅長於處理棘手的問題' },
      { value: 2, text: '我是個很熱心的人，我喜歡跟別人一起工作' },
      { value: 3, text: '我喜歡聽而不喜歡說話，我一開口都說得很委婉溫和' },
      { value: 4, text: '處理事我較不動感情，是就是，不把感情牽扯進來，也較少與人閒聊' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我喜歡有競爭，有競爭才能把潛能完全發揮出來' },
      { value: 2, text: '我較感性，與人相處或處事較不注意細節' },
      { value: 3, text: '我是個理性的組員，順著群眾，具有高度的團體意識' },
      { value: 4, text: '對事我喜歡去研究，講求證據與保證' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我喜歡能力與權威，這是我想要的' },
      { value: 2, text: '我有時情緒化，一旦生氣常氣過頭。有時置身於有趣事務中，往往無法掌握時間' },
      { value: 3, text: '我喜歡按部就班，穩紮穩打，慢慢做事，不喜歡破斧沈舟的方式' },
      { value: 4, text: '我很注意事務與人的細節' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '對直接關係的環境，我有喜歡去掌握及支配他人的傾向' },
      { value: 2, text: '在團體中我喜歡打成一片，活活潑潑有氣氛，有感情的相處' },
      { value: 3, text: '我較遵守傳統的步驟做事，不喜歡有很大的變化' },
      { value: 4, text: '在沒有掌握事實的真象與更多資料之前，我寧可保持現狀' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我在與人溝通時，直接了當的說，不喜歡兜圈子' },
      { value: 2, text: '我喜歡幫助人，相親相愛' },
      { value: 3, text: '我不喜歡多變化的環境，而要穩定安全的生活方式' },
      { value: 4, text: '凡事我要求的是準確無誤，講求的是高品質，高標準的處事原則' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我不喜歡別人逗我開心，不喜歡太多話的人' },
      { value: 2, text: '我喜歡參加團體活動，因為與很多人在一起感覺很好' },
      { value: 3, text: '對事情我沒有太多要求與意見，喜歡靜靜的有耐心的做' },
      { value: 4, text: '我做事要有一套經過計劃設計的標準作業程序來引導作業方向' }
    ]
  },
  {
    text: '依照直覺選一個：',
    options: [
      { value: 1, text: '我討厭別人告訴我事情該如何做，因我自有定見，我不喜歡被別人支配' },
      { value: 2, text: '我是個生氣勃勃外向的人，別人愛跟我一起工作，因為別人與我一起工作，就會激起他們的熱心，我就是有那能耐' },
      { value: 3, text: '我喜歡獨處，若與人生活在一起，會儘量不去打擾他人居家生活' },
      { value: 4, text: '我很少加入別人的閒聊中，當話題有趣時，我會找更多的資料，小心的進行外交策略' }
    ]
  }
];